<?php
// +----------------------------------------------------------------------
// | Description: 基础框架路由配置文件 学习前端代码 调试测试api
// +----------------------------------------------------------------------
// | Author: linchuangbin <linchuangbin@honghaiweb.com>
// +----------------------------------------------------------------------

return [

/**
 * 原则：
 *   1、尽量使前台在初始化化渲染页面时只需请求一次；
 *   2、建议按页面分，如果按功能和按页面无明显优势则按页面分；
 *      如获取首页banner图 放在首页的控制器内，但是如果多个页面引用可提出公共的控制器下
 */

// 【 测试Bootstrap-Table 】
    // 查询列表
    'api/bootstraptable/list'       => ['api/BootStrapTables/listdata', ['method' => 'GET']],
    // 编辑
    'api/bootstraptable/edit'       => ['api/BootStrapTables/edit', ['method' => 'POST']],
    

  //【 其他 】
    // 【 MISS路由 】
    '__miss__'  => 'base/miss',




/*-----------------------------------------------------------------------------*/

];