// +----------------------------------------------------------------------
// | Description: 公共JavaScript函数。
// +----------------------------------------------------------------------
// | Author: xiezhenbin <Xzbde163yx@163.com>
// +----------------------------------------------------------------------



/**
 *   
 *   引用说明需要引用jquery、layer
 *   (此处不引用是担心页面引用了不同版本的jquery导致冲突)
 *   
 */



/** 
 *  接口请求路由
 *  @param   str    路由名
 *  @return  json   
 */
function fn001() 
{
    
    var result = {};

    return result;
}